In [11]:
import pandas as pd
data = pd.DataFrame({'price':[95,25,85,41],
                     'ticker':['AXP','CSCO','DIS',None],
                     'company':['American Express','Cisco','Walt Disney','Microsoft']})
data

   price ticker           company
0     95    AXP  American Express
1     25   CSCO             Cisco
2     85    DIS       Walt Disney
3     41   None         Microsoft

In [12]:
data.loc[2]['price']

85

In [13]:
data.iloc[2]['ticker']

'DIS'

In [14]:
data.dtypes

price       int64
ticker     object
company    object
dtype: object

In [15]:
data.count() #Count non-NA cells for each column or row.

price      4
ticker     3
company    4
dtype: int64

In [16]:
import numpy as np
df = pd.DataFrame({"Person":["John", "Myla", "Lewis", "John", "Myla"],
                   "Age": [24., np.nan, 21, 33, 26],
"Single": [False, True, True, True, False]})
df

  Person   Age  Single
0   John  24.0   False
1   Myla   NaN    True
2  Lewis  21.0    True
3   John  33.0    True
4   Myla  26.0   False

In [17]:
df.count()

Person    5
Age       4
Single    5
dtype: int64

In [18]:
df.count(axis='rows')  #check for columns also

Person    5
Age       4
Single    5
dtype: int64

In [19]:
df.count(axis = 'columns')

0    3
1    2
2    3
3    3
4    3
dtype: int64

In [23]:
#df
df.set_index(["Person", "Single"])

                Age
Person Single
John   False   24.0
Myla   True     NaN
Lewis  True    21.0
John   True    33.0
Myla   False   26.0

In [25]:
df.set_index(["Person", "Single"]).count(level="Single") #as Myla has a NAN value

        Age
Single
False     2
True      2

In [26]:
data

   price ticker           company
0     95    AXP  American Express
1     25   CSCO             Cisco
2     85    DIS       Walt Disney
3     41   None         Microsoft

In [27]:
data.describe()

           price
count   4.000000
mean   61.500000
std    33.798422
min    25.000000
25%    37.000000
50%    63.000000
75%    87.500000
max    95.000000

In [30]:
#Describing a categorical Series.
s = pd.Series(['a', 'a', 'b', 'c'])
print(s.describe())
print(s)
#For object data, the result’s index will include count, unique, top, and freq. 
#The top is the most common value. 
#The freq is the most common value’s frequency

count     4
unique    3
top       a
freq      2
dtype: object
0    a
1    a
2    b
3    c
dtype: object

In [31]:
data

   price ticker           company
0     95    AXP  American Express
1     25   CSCO             Cisco
2     85    DIS       Walt Disney
3     41   None         Microsoft

In [32]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
price      4 non-null int64
ticker     3 non-null object
company    4 non-null object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [33]:
import numpy as np
df1 = pd.DataFrame(np.arange(12).reshape((3, 4)),columns=list('abcd'))
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [34]:
df2 = pd.DataFrame(np.arange(20).reshape((4, 5)),columns=list('abcde'))
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [38]:
df2.loc[1,'b'] = np.nan
df2

    a     b   c   d   e
0   0   1.0   2   3   4
1   5   NaN   7   8   9
2  10  11.0  12  13  14
3  15  16.0  17  18  19

In [39]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [40]:
df1.add(df2)

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [43]:
df1
#df1.add(df2, fill_value=1)

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [44]:
df2

    a     b   c   d   e
0   0   1.0   2   3   4
1   5   NaN   7   8   9
2  10  11.0  12  13  14
3  15  16.0  17  18  19

In [45]:
df1.add(df2, fill_value=1)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   5.0
1   9.0   6.0  13.0  15.0  10.0
2  18.0  20.0  22.0  24.0  15.0
3  16.0  17.0  18.0  19.0  20.0

In [46]:
df = pd.DataFrame(np.random.randn(5,3),
                  index = ['a','c','e','f','h'],columns = ['one','two','three'])
df

        one       two     three
a -1.585338  0.753689  0.182669
c -0.170313 -1.553528  1.776612
e -1.508780 -1.765807 -0.381653
f -0.571045 -0.601994 -0.539730
h  0.266686 -1.335342 -1.039436

In [47]:
df2 = df.reindex(['a','b','c','d','e','f','g','h'])
df2

        one       two     three
a -1.585338  0.753689  0.182669
b       NaN       NaN       NaN
c -0.170313 -1.553528  1.776612
d       NaN       NaN       NaN
e -1.508780 -1.765807 -0.381653
f -0.571045 -0.601994 -0.539730
g       NaN       NaN       NaN
h  0.266686 -1.335342 -1.039436

In [48]:
#count of missing values
df2.isnull().sum()

one      3
two      3
three    3
dtype: int64

In [49]:
df2.dropna()

        one       two     three
a -1.585338  0.753689  0.182669
c -0.170313 -1.553528  1.776612
e -1.508780 -1.765807 -0.381653
f -0.571045 -0.601994 -0.539730
h  0.266686 -1.335342 -1.039436

In [51]:
df2.fillna(0)

        one       two     three
a -1.585338  0.753689  0.182669
b  0.000000  0.000000  0.000000
c -0.170313 -1.553528  1.776612
d  0.000000  0.000000  0.000000
e -1.508780 -1.765807 -0.381653
f -0.571045 -0.601994 -0.539730
g  0.000000  0.000000  0.000000
h  0.266686 -1.335342 -1.039436

In [59]:
df3 = df2.fillna(method = 'bfill',axis = 0)
df3

        one       two     three
a -1.585338  0.753689  0.182669
b -0.170313 -1.553528  1.776612
c -0.170313 -1.553528  1.776612
d -1.508780 -1.765807 -0.381653
e -1.508780 -1.765807 -0.381653
f -0.571045 -0.601994 -0.539730
g  0.266686 -1.335342 -1.039436
h  0.266686 -1.335342 -1.039436

In [56]:
df4 = df2.fillna(method = 'ffill',axis = 0).fillna(0)
df4

        one       two     three
a -1.585338  0.753689  0.182669
b -1.585338  0.753689  0.182669
c -0.170313 -1.553528  1.776612
d -0.170313 -1.553528  1.776612
e -1.508780 -1.765807 -0.381653
f -0.571045 -0.601994 -0.539730
g -0.571045 -0.601994 -0.539730
h  0.266686 -1.335342 -1.039436

In [60]:
df = pd.DataFrame([['ant', 'bee', 'cat'], ['dog', None, 'fly']])
df

     0     1    2
0  ant   bee  cat
1  dog  None  fly

In [61]:
pd.isna(df) #detecting missing values

       0      1      2
0  False  False  False
1  False   True  False

In [62]:
df.isna()

       0      1      2
0  False  False  False
1  False   True  False

In [65]:
pd.isna(df[1])

0    False
1     True
Name: 1, dtype: bool

In [67]:
#Replace values given in to_replace with value.
s = pd.Series([0, 1, 2, 3, 4])
s

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [68]:
s.replace(0,5)

0    5
1    1
2    2
3    3
4    4
dtype: int64

In [70]:
df = pd.DataFrame({'A': [0, 1, 2, 3, 4],'B': [5, 6, 7, 8, 9],'C': ['a', 'b', 'c', 'd', 'e']})
df
df.replace(0, 5)
#df.replace([0, 1, 2, 3], 4)
#df.replace([0, 1, 2, 3], [4, 3, 2, 1])

   A  B  C
0  5  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e

In [71]:
df.replace([0, 1, 2, 3], 4)

   A  B  C
0  4  5  a
1  4  6  b
2  4  7  c
3  4  8  d
4  4  9  e

In [72]:
df.replace([0, 1, 2, 3], [4, 3, 2, 1])

   A  B  C
0  4  5  a
1  3  6  b
2  2  7  c
3  1  8  d
4  4  9  e

In [73]:
#dict-like 'to_replace'
df.replace({0: 10, 1: 100})

     A  B  C
0   10  5  a
1  100  6  b
2    2  7  c
3    3  8  d
4    4  9  e

In [74]:
df = pd.DataFrame({'A': ['bat', 'foo', 'bait'],'B': ['abc', 'bar', 'xyz']})
df

      A    B
0   bat  abc
1   foo  bar
2  bait  xyz

In [77]:
df.replace(to_replace=r'^ba', value='new', regex=True)

       A     B
0   newt   abc
1    foo  newr
2  newit   xyz

In [78]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [79]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [82]:
frame.sort_index(axis = 1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [83]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'],
                   'B': ['one', 'one', 'two', 'three','two', 'two', 'one', 'three'],
   'C': np.random.randn(8),'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one  1.264695 -0.823378
1  bar    one -1.254703  0.525125
2  foo    two  1.274348 -1.592296
3  bar  three -1.131503 -0.111951
4  foo    two  0.375725 -0.072417
5  bar    two  0.516435 -0.775553
6  foo    one  0.236808  0.614875
7  foo  three  1.112009  2.281601

In [85]:
df.groupby('A').sum()

            C         D
A
bar -1.869771 -0.362379
foo  4.263585  0.408386

In [87]:
#Grouping by multiple columns forms a hierarchical index, and again we can apply the sum function.
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one   -1.254703  0.525125
    three -1.131503 -0.111951
    two    0.516435 -0.775553
foo one    1.501503 -0.208503
    three  1.112009  2.281601
    two    1.650073 -1.664712

In [88]:
#The function pivot_table() can be used to create spreadsheet-style pivot tables
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,'B': ['A', 'B', 'C'] * 4,
                    'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,'D': np.random.randn(12),
                    'E': np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo -0.321545  0.192408
1     one  B  foo -0.573026 -0.256519
2     two  C  foo  0.660484 -0.341643
3   three  A  bar  0.910848 -0.324555
4     one  B  bar  0.385963  0.874983
5     one  C  bar  1.839347  2.112549
6     two  A  foo  1.309481 -0.012043
7   three  B  foo  0.102924  0.218946
8     one  C  foo  1.561681 -0.560644
9     one  A  bar -0.194726 -0.854002
10    two  B  bar -0.299282  0.579707
11  three  C  bar -1.104014  0.487178

In [89]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -0.194726 -0.321545
      B  0.385963 -0.573026
      C  1.839347  1.561681
three A  0.910848       NaN
      B       NaN  0.102924
      C -1.104014       NaN
two   A       NaN  1.309481
      B -0.299282       NaN
      C       NaN  0.660484

In [109]:
df = pd.DataFrame(data={'Animal': ['cat', 'penguin', 'dog','spider', 'snake'],
                        'Number_legs': [4, 2, 4, 8, np.nan]})
df

    Animal  Number_legs
0      cat          4.0
1  penguin          2.0
2      dog          4.0
3   spider          8.0
4    snake          NaN

default_rank: this is the default behaviour obtained without using any parameter.
max_rank: setting method = 'max' the records that have the same values are ranked using the highest rank (e.g.: since ‘cat’ and ‘dog’ are both in the 2nd and 3rd position, rank 3 is assigned.)
NA_bottom: choosing na_option = 'bottom', if there are records with NaN values they are placed at the bottom of the ranking.
pct_rank: when setting pct = True, the ranking is expressed as percentile rank.

In [110]:
df['default_rank'] = df['Number_legs'].rank()
df

    Animal  Number_legs  default_rank
0      cat          4.0           2.5
1  penguin          2.0           1.0
2      dog          4.0           2.5
3   spider          8.0           4.0
4    snake          NaN           NaN

In [111]:
#method : {‘average’, ‘min’, ‘max’, ‘first’, ‘dense’}, default ‘average’
#How to rank the group of records that have the same value (i.e. ties):
#average: average rank of the group
#min: lowest rank in the group
#max: highest rank in the group
#first: ranks assigned in order they appear in the array
#dense: like ‘min’, but rank always increases by 1 between groups
df['max_rank'] = df['Number_legs'].rank(method='max')  
df

    Animal  Number_legs  default_rank  max_rank
0      cat          4.0           2.5       3.0
1  penguin          2.0           1.0       1.0
2      dog          4.0           2.5       3.0
3   spider          8.0           4.0       4.0
4    snake          NaN           NaN       NaN

In [112]:
df['max_rank'] = df['Number_legs'].rank(method='first')  
df

    Animal  Number_legs  default_rank  max_rank
0      cat          4.0           2.5       2.0
1  penguin          2.0           1.0       1.0
2      dog          4.0           2.5       3.0
3   spider          8.0           4.0       4.0
4    snake          NaN           NaN       NaN

In [113]:
df['NA_bottom'] = df['Number_legs'].rank(na_option='bottom')
df

    Animal  Number_legs  default_rank  max_rank  NA_bottom
0      cat          4.0           2.5       2.0        2.5
1  penguin          2.0           1.0       1.0        1.0
2      dog          4.0           2.5       3.0        2.5
3   spider          8.0           4.0       4.0        4.0
4    snake          NaN           NaN       NaN        5.0

In [114]:
df['pct_rank'] = df['Number_legs'].rank(pct=True)
df

    Animal  Number_legs  default_rank  max_rank  NA_bottom  pct_rank
0      cat          4.0           2.5       2.0        2.5     0.625
1  penguin          2.0           1.0       1.0        1.0     0.250
2      dog          4.0           2.5       3.0        2.5     0.625
3   spider          8.0           4.0       4.0        4.0     1.000
4    snake          NaN           NaN       NaN        5.0       NaN

In [115]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [117]:
obj.rank(method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [1]:
import pandas as pd
#pandas can include categorical data in a DataFrame.
df = pd.DataFrame({"id": [1, 2, 3, 4, 5, 6],"raw_grade": ['a', 'b', 'b', 'a', 'a', 'e']})

In [2]:
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [4]:
#Convert the raw grades to a categorical data type
df["grade"] = df["raw_grade"].astype("category")
df['grade']

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [5]:
#Rename the categories to more meaningful names
df["grade"].cat.categories = ["very good", "good", "very bad"]
df

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [6]:
#Reorder the categories and simultaneously add the missing categories 
#(methods under Series .cat return a new Series by default).
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium","good", "very good"])
df['grade']

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): [very bad, bad, medium, good, very good]

In [7]:
#Sorting is per order in the categories
df.sort_values("grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [8]:
#Grouping by a categorical column also shows empty categories.
df.groupby("grade").size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64

In [125]:
import pandas as pd
df = pd.read_table("sample.txt")
df

   ab
0   1
1  23
2  45

In [126]:
import pandas as pd
d = pd.read_table("ex1.csv")
d

  a,b,c,d,message
0   1,2,3,4,hello
1   5,6,7,8,world
2  9,10,11,12,foo

In [129]:
d = pd.read_table("ex1.csv",sep=',')
d

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [130]:
a = pd.read_csv("ex1.csv")
a

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [131]:
a = pd.read_csv("ex1.csv",header = None)
a

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [135]:
import sys
a.to_csv(sys.stdout,sep='|')

|0|1|2|3|4
0|a|b|c|d|message
1|1|2|3|4|hello
2|5|6|7|8|world
3|9|10|11|12|foo

In [136]:
a.to_csv(sys.stdout, na_rep='NULL')

,0,1,2,3,4
0,a,b,c,d,message
1,1,2,3,4,hello
2,5,6,7,8,world
3,9,10,11,12,foo

In [138]:
dates = pd.date_range('1/1/2000', periods=7)
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [141]:
import numpy as np
ts = pd.Series(np.arange(7), index=dates)
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [142]:
ts.to_csv("timeseries.csv")

C:\Users\Administrator\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  """Entry point for launching an IPython kernel.

In [143]:
sample = pd.read_csv("timeseries.csv")
sample.to_html('test.html')

In [144]:
import sqlite3 #lightweight disk-based database

In [145]:
query = "CREATE TABLE test(a VARCHAR(20), b VARCHAR(20),c REAL,d INTEGER);"

In [146]:
con = sqlite3.connect('mydata06.sqlite')

In [147]:
con.execute(query)

In [148]:
con.commit()

In [149]:
data = [('Atlanta','Georgia', 1.25, 6),('Tallahassee', 'Florida', 2.6, 3),('Sacramento', 'California', 1.7, 5)]

In [150]:
data

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [151]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [152]:
con.executemany(stmt, data)

In [153]:
con.commit()

In [154]:
cursor = con.execute('select * from test')

In [155]:
cursor

In [156]:
rows = cursor.fetchall()

In [157]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [158]:
import pandas as pd
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [159]:
pd.read_csv('ex6.csv').head()

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [174]:
chunker = pd.read_csv('ex6.csv', chunksize=100)

In [175]:
tot = pd.Series([]) 
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
    tot = tot.sort_values(ascending=False)

In [176]:
tot

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
V    328.0
I    327.0
U    326.0
P    324.0
D    320.0
A    320.0
R    318.0
Y    314.0
G    308.0
S    308.0
N    306.0
W    305.0
T    304.0
B    302.0
Z    288.0
C    286.0
4    171.0
6    166.0
7    164.0
8    162.0
3    162.0
5    157.0
2    152.0
0    151.0
9    150.0
1    146.0
dtype: float64

In [178]:
obj ="""{"name": "Wes", 
       "places_lived": ["United States", "Spain", "Germany"],
       "pet": null,
       "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},             
       {"name": "Katie", "age": 38,              
      "pets": ["Sixes", "Stache", "Cisco"]}]
        }"""

In [179]:
import json
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [180]:
tables = pd.read_html('fdic_failed_bank_list.html')

In [181]:
len(tables)

1

In [185]:
failures = tables[0]

In [186]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [190]:
close_timestamps = pd.to_datetime(failures['Updated Date'])

In [191]:
close_timestamps

0     2016-11-17
1     2016-11-17
2     2016-09-06
3     2016-09-06
4     2016-06-16
         ...
542   2014-08-19
543   2002-11-18
544   2003-02-18
545   2005-03-17
546   2005-03-17
Name: Updated Date, Length: 547, dtype: datetime64[ns]

In [192]:
close_timestamps.dt.year.value_counts()

2012    227
2014    109
2016     91
2015     66
2013     36
2008      6
2005      5
2004      2
2003      2
2010      1
2006      1
2002      1
Name: Updated Date, dtype: int64

In [199]:
xlsx = pd.ExcelFile('ex1.xlsx')

In [200]:
pd.read_excel(xlsx)

   today  a   b   c   d message
0      0  1   2   3   4   hello
1      1  5   6   7   8   world
2      2  9  10  11  12     foo

In [9]:
import requests

In [10]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [11]:
resp = requests.get(url)

In [12]:
resp

In [15]:
data = resp.json()

In [19]:
data[0]['title']

'%s changed to fstring, single quotes in f string changed to double qu…'

In [20]:
import pandas as pd
issues = pd.DataFrame(data, columns=['number', 'title','labels', 'state'])

In [21]:
issues

,number,title,labels,state
0,30108,"%s changed to fstring, single quotes in f stri...",[],open
1,30107,"When applied as style in to_excel(), 'vertical...",[],open
2,30106,df.to_excel gives TypeError,[],open
3,30103,"DEPR: Index.contains, DatetimeIndex.offset","[{'id': 87485152, 'node_id': 'MDU6TGFiZWw4NzQ4...",open
4,30100,REF: implement io.pytables._maybe_adjust_name,"[{'id': 47229190, 'node_id': 'MDU6TGFiZWw0NzIy...",open
5,30099,CI: Unwanted patterns checks,[],open
6,30097,API: Handle pow & rpow special cases,"[{'id': 2822342, 'node_id': 'MDU6TGFiZWwyODIyM...",open
7,30095,PERF: improve conversion to BooleanArray from ...,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
8,30093,"STY: fstrings, repr pandas/io/html.py","[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
9,30092,Can't use named aggregation with resample.,[],open
10,30091,BUG: preserve EA dtype in transpose,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
11,30087,pandas.read_sql_table switches double quotatio...,[],open
12,30086,Series.searchsorted with different timezones,[],open
13,30083,Fixes Error thrown when None is passed to pd.t...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
14,30081,Interface mismatch between fastparquet and pya...,"[{'id': 685114413, 'node_id': 'MDU6TGFiZWw2ODU...",open
15,30079,"TYP: Annotations in pandas/core/{accessor, sor...","[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open
16,30078,EWM functions fail with superclasses of pd.Dat...,[],open
17,30077,BUG/TST: fix arrow roundtrip / parquet tests f...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
18,30073,#29886 - Replace !r for repr() on pandas/io/pa...,"[{'id': 127681, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
19,30070,CI: troubleshoot codecov,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
20,30063,round method fails when columns are Categorica...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
21,30062,API: BooleanArray any/all with NA logic,[],open
22,30061,Replace custom macro with stdlib,[],open
23,30057,Resampling on index and column after groupby g...,[],open
24,30056,DOC: Documentation for MultiIndex.get_locs() ...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
25,30054,DOC: Style format,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
26,30053,`MultiIndex.get_loc` throws `KeyError` under s...,[],open
27,30051,read_sas floating point error (SAS version 6),[],open
28,30050,TypeError in to_datetime when passing Int64 co...,[],open
29,30048,27820 clarify that read parquet accepts a dire...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open